In [1]:
import numpy as np
import pandas as pd

from bhishan import bp

In [ ]:
df = pd.DataFrame({'A':[10,20,30],
            'B':['USA','Japan','Germany'],
            'C': [100,200,300],
             'D': ['Washington','Tokyo','Brussles']})

In [7]:
bp.style_row(df,1)

In [10]:
bp.style_col(df,1)

In [11]:
bp.style_rowcol(df,(0,1))

In [14]:
bp.style_diag(df,diag='second')